docs/03-modele-de-donnees.md
```mermaid
erDiagram
    UTILISATEUR ||--o{ BENEFICIAIRE : possede
    UTILISATEUR ||--o{ TRANSFERT : effectue
    BENEFICIAIRE ||--o{ TRANSFERT : vise

    UTILISATEUR {
        int id PK
        string email UK
        string mot_de_passe
        string nom
        enum role
        bool rgpd_accepte
        datetime date_creation
    }
    BENEFICIAIRE {
        int id PK
        string nom_complet
        string email
        string iban
        int utilisateur_id FK
        datetime date_creation
    }
    TRANSFERT {
        int id PK
        decimal montant_fcfa
        decimal montant_eur
        decimal frais_fcfa
        decimal taux_change
        enum statut
        string reference UK
        int utilisateur_id FK
        int beneficiaire_id FK
        datetime date_creation
    }
```
